
network_name: VGG19Test
dataset_name: break_his
dataset_count: (1463, 309, 309)
image_size: (150, 150)
data_augmentation: True
batch_size: 32
classes: 8
train_generator: <keras.preprocessing.image.DirectoryIterator object at 0x7fda41706128>
validation_generator: <keras.preprocessing.image.DirectoryIterator object at 0x7fda69945208>
test_generator: <keras.preprocessing.image.DirectoryIterator object at 0x7fda69945e48>
weights: imagenet
include_top: False
convolutional_base: <keras.engine.training.Model object at 0x7fda697a5780>
model: <keras.engine.sequential.Sequential object at 0x7fda697a5550>
loss: categorical_crossentropy
learning_rate: 0.0001
optimizer: rmsprop
metrics: ['acc']
epochs: 150
history: <keras.callbacks.callbacks.History object at 0x7fda416a83c8>
predictions: [4 1 1 3 2 0 1 1 6 3 1 1 7 1 1 4 1 4 1 2 4 1 1 2 7 1 7 1 1 7 1 4 4 7 7 7 1
 1 3 5 5 0 2 4 1 1 1 5 1 4 2 1 1 2 4 3 1 1 1 2 5 2 2 1 1 2 1 0 0 1 1 7 5 4
 2 1 7 1 6 4 1 2 0 6 1 1 1 1 7 6 1 1 2 0 1 1 1 1 1 5 1 3 1 6 2 0 0 6 0 1 7
 1 1 1 1 1 1 1 1 4 1 0 1 1 2 1 1 1 2 1 1 3 1 6 3 1 1 2 1 2 3 1 1 1 2 3 1 0
 4 1 1 2 1 1 1 1 2 2 1 1 1 1 1 1 7 1 1 1 7 1 1 4 5 1 1 2 6 2 5 1 7 6 2 1 7
 5 5 1 1 2 2 6 2 5 1 7 4 1 2 1 1 1 7 4 1 1 7 1 1 7 1 4 2 3 5 3 1 7 2 1 2 4
 1 3 6 1 3 2 1 4 3 2 1 0 1 1 2 2 1 1 7 1 5 1 3 1 0 4 1 2 1 1 1 4 1 1 1 2 3
 7 1 5 7 2 1 1 2 1 1 0 1 1 7 1 1 4 7 3 1 7 1 1 1 0 1 1 7 1 5 7 2 2 6 1 1 1
 3 2 0 4 7 4 2 1 1 2 1 1 1]


Model: "vgg19"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 150, 150, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 150, 150, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 150, 150, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 75, 75, 64)        0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 75, 75, 128)       73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 75, 75, 128)       147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 37, 37, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 37, 37, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 37, 37, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 37, 37, 256)       590080    
_________________________________________________________________
block3_conv4 (Conv2D)        (None, 37, 37, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 18, 18, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 18, 18, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 18, 18, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 18, 18, 512)       2359808   
_________________________________________________________________
block4_conv4 (Conv2D)        (None, 18, 18, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 9, 9, 512)         0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 9, 9, 512)         2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 9, 9, 512)         2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 9, 9, 512)         2359808   
_________________________________________________________________
block5_conv4 (Conv2D)        (None, 9, 9, 512)         2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 4, 4, 512)         0         
=================================================================
Total params: 20,024,384
Trainable params: 0
Non-trainable params: 20,024,384
_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
vgg19 (Model)                (None, 4, 4, 512)         20024384  
_________________________________________________________________
flatten (Flatten)            (None, 8192)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               4194816   
_________________________________________________________________
dropout_1 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1024)              525312    
_________________________________________________________________
dropout_2 (Dropout)          (None, 1024)              0         
_________________________________________________________________
predictions (Dense)          (None, 8)                 8200      
=================================================================
Total params: 24,752,712
Trainable params: 4,728,328
Non-trainable params: 20,024,384
_________________________________________________________________


training and validation accuracy and loss: 

     accuracy      loss  validation accuracy  validation loss
0    0.401118  1.883955             0.444444         1.455419
1    0.410203  1.788883             0.440433         1.647806
2    0.440950  1.701395             0.407942         1.815250
3    0.424179  1.672132             0.462094         1.646952
4    0.471698  1.611912             0.465704         1.591783
..        ...       ...                  ...              ...
145  0.732355  0.732211             0.642599         1.134860
146  0.739343  0.731705             0.581227         0.961017
147  0.730259  0.752441             0.613718         0.916213
148  0.723969  0.760521             0.606498         1.133217
149  0.740042  0.721894             0.617329         1.182394

[150 rows x 4 columns]

confusion matrix: 

[[ 1  8  1  2  2  0  1  1]
 [10 67 18  7 11  6  6 10]
 [ 0 21  7  0  1  4  2  4]
 [ 0 10  4  1  3  2  1  4]
 [ 2 13  6  5  3  1  1  2]
 [ 0 12  4  1  1  1  0  2]
 [ 2 10  0  1  1  0  0  4]
 [ 1  9  5  1  2  1  1  2]]

test accuracy: 0.6215277910232544
test loss: 1.189723253250122