_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
block1_conv1 (Conv2D)        (None, 148, 148, 32)      896       
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 146, 146, 32)      9248      
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 73, 73, 32)        0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 71, 71, 64)        18496     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 69, 69, 64)        36928     
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 34, 34, 64)        0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 32, 32, 128)       73856     
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 30, 30, 128)       147584    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 28, 28, 128)       147584    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 14, 14, 128)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 12, 12, 256)       295168    
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 10, 10, 256)       590080    
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 8, 8, 256)         590080    
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 4, 4, 256)         0         
_________________________________________________________________
flatten (Flatten)            (None, 4096)              0         
_________________________________________________________________
dense1 (Dense)               (None, 512)               2097664   
_________________________________________________________________
dropout1 (Dropout)           (None, 512)               0         
_________________________________________________________________
dense2 (Dense)               (None, 1024)              525312    
_________________________________________________________________
dropout2 (Dropout)           (None, 1024)              0         
_________________________________________________________________
prediction (Dense)           (None, 9)                 9225      
=================================================================
Total params: 4,542,121
Trainable params: 4,542,121
Non-trainable params: 0
_________________________________________________________________

